; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	spectrograph2 - mode
	thermograph3 - mode
	infrared1 - mode
	spectrograph0 - mode
	image4 - mode
	Star7 - direction
	GroundStation0 - direction
	Star5 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Star8 - direction
	Star6 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 thermograph3)
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star8)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon10)
	(supports instrument1 thermograph3)
	(supports instrument1 spectrograph0)
	(supports instrument1 image4)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 image4)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument3 image4)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 infrared1)
	(supports instrument4 spectrograph0)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 Star8)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation1)
)
(:goal (and
	(pointing satellite2 GroundStation0)
	(have_image Star9 spectrograph0)
	(have_image Phenomenon10 spectrograph2)
	(have_image Planet11 thermograph3)
	(have_image Phenomenon12 spectrograph0)
	(have_image Planet13 infrared1)
	(have_image Phenomenon14 image4)
))

)

; plan
1. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 7
2. (calibrate satellite2 instrument3 groundstation1)
   added: (calibrated instrument3)
   goals met: 0 of 7
3. (turn_to satellite2 phenomenon14 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon14)
   goals met: 0 of 7
4. (take_image satellite2 phenomenon14 instrument3 image4)
   added: (have_image phenomenon14 image4)
   goals met: 1 of 7
5. (turn_to satellite2 phenomenon10 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 phenomenon10)
   goals met: 1 of 7
6. (take_image satellite2 phenomenon10 instrument3 spectrograph2)
   added: (have_image phenomenon10 spectrograph2)
   goals met: 2 of 7
7. (turn_to satellite2 star6 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 star6)
   goals met: 2 of 7
8. (switch_off instrument3 satellite2)
   deleted: (power_on instrument3)
   added: (power_avail satellite2)
   goals met: 2 of 7
9. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 2 of 7
10. (calibrate satellite2 instrument4 star6)
   added: (calibrated instrument4)
   goals met: 2 of 7
11. (turn_to satellite2 phenomenon12 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 phenomenon12)
   goals met: 2 of 7
12. (take_image satellite2 phenomenon12 instrument4 spectrograph0)
   added: (have_image phenomenon12 spectrograph0)
   goals met: 3 of 7
13. (turn_to satellite2 planet11 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 planet11)
   goals met: 3 of 7
14. (take_image satellite2 planet11 instrument4 thermograph3)
   added: (have_image planet11 thermograph3)
   goals met: 4 of 7
15. (turn_to satellite2 planet13 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 planet13)
   goals met: 4 of 7
16. (take_image satellite2 planet13 instrument4 infrared1)
   added: (have_image planet13 infrared1)
   goals met: 5 of 7
17. (turn_to satellite2 star9 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 star9)
   goals met: 5 of 7
18. (take_image satellite2 star9 instrument4 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 6 of 7
19. (turn_to satellite2 groundstation0 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 groundstation0)
   goals met: 7 of 7
